{
    "version": "https://jsonfeed.org/version/1",
    "title": "T4P4N",
    "home_page_url": "https://t4p4n.github.io/",
    "feed_url": "https://t4p4n.github.io/feed.json",
    "description": "I'm Tapan Kashyap. Welcome to my personal space on the internet.",
    "icon": "https://t4p4n.github.io/apple-touch-icon.png",
    "favicon": "https://t4p4n.github.io/favicon.ico",
    "expired": false,
    
    "author":  {
        "name": "Tapan Kashyap",
        "url": null,
        "avatar": null
    },
    
"items": [
    
        {
            "id": "https://t4p4n.github.io/2022/05/25/palindrome-python",
            "title": "Palindrome detection python script.",
            "summary": "Palindrome detection using python",
            "content_text": "RotavatorPalindrome? What is it !?  Its just a fancy term for saying something like this:  string/integer matches to their reverse.  Example: POP equals to POP(reverse of pop)  Another example: madam equals to madam(reverse of madam)      Yet another example: Rotavator equals to rotvatoR(reverse of rotavator)    non-examples aka false statements:  “Hello world” equals to “dlrow olleH”      “definetly not” equals to “ton yltenifed”    Python code for this type of program```data = input(“Enter something: “)def is_palindrome(data):    reverse = data[::-1]    if data == reverse:        print(“Yes”)        return True    print(“Nope”)    return Falseis_palindrome(data)```  suggested improvements:  we can use manual function for string reversal  instead of using python slicling magic.Hope learned something today atleast i did for sure.Thanks for reading :)",
            "content_html": "<h1 id=\"rotavator\">Rotavator</h1><p><img src=\"https://img2.exportersindia.com/product_images/bc-full/dir_10/289726/rotavator-1512462441-3497789.jpeg\" alt=\"Rotavator\" title=\"a rotavator\" /></p><h2 id=\"palindrome-what-is-it-\">Palindrome? What is it !?</h2><ul>  <li>Its just a fancy term for saying something like this:</li>  <li>string/integer matches to their reverse.</li>  <li>Example: POP equals to POP(reverse of pop)</li>  <li>Another example: madam equals to madam(reverse of madam)</li>  <li>    <p>Yet another example: Rotavator equals to rotvatoR(reverse of rotavator)</p>  </li>  <li>non-examples aka false statements:</li>  <li>“Hello world” equals to “dlrow olleH”</li>  <li>    <p>“definetly not” equals to “ton yltenifed”</p>  </li>  <li>Python code for this type of program```data = input(“Enter something: “)</li></ul><p>def is_palindrome(data):    reverse = data[::-1]    if data == reverse:        print(“Yes”)        return True    print(“Nope”)    return False</p><p>is_palindrome(data)```</p><ul>  <li>suggested improvements:</li>  <li>we can use manual function for string reversal</li>  <li>instead of using python slicling magic.</li></ul><h3 id=\"hope-learned-something-today-atleast-i-did-for-sure\">Hope learned something today atleast i did for sure.</h3><h3 id=\"thanks-for-reading-\">Thanks for reading :)</h3>",
            "url": "https://t4p4n.github.io/2022/05/25/palindrome-python",
            
            
            
            "tags": ["python,","palindrome,","string,","algorithms"],
            
            "date_published": "2022-05-25T00:00:00+05:30",
            "date_modified": "2022-05-25T00:00:00+05:30",
            
                "author":  {
                "name": "Tapan Kashyap",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://t4p4n.github.io/2021/12/24/education-rant",
            "title": "Education Rant",
            "summary": "How modern education system in india is a disaster.",
            "content_text": "Problems or (What &amp; Why?)??Why people are chasing success? What do they mean by success? is financial success is everything?  As of now in 2021's India Most people think success is getting a govt. job &amp; that's it!But I dont think so? is govt job is keep up to everything want in life? No, its just a secure jobwhile nothing is permanent in this world, they think are settled, but in real life, nobody gets settledafter getting, we gotta repeat same things almost daily, and repetition is equal to boredom.  From my perespective i think life is about balacing all aspects of human a beings' life,I mean keeping everything balanced from work life to social life, childhood to parenthood, physical health to mental health everything needs to balanced, While our education system only teachs about how to get a job, not how to live a life.  Anyways here are some problems that i faced/found in our current indian education system while i was studying commerce from school &amp;  college.Irrelevant subjects  Like Business &amp; Industerial Laws, Hindi Language. This subject must be relevant to Law/Hindi specialization students only.  However these subjects can be recommended &amp; but not mandatory to study (Optionally any one can look it up on internet, if they want to).Out of date syllabus/circicullum  In modern day society accounting is mostly done through computers. But they dont teach us about computers  They dont teach us about Book Keeping softwares like Busy, Tally etc.  &amp; Even Nowadays from manufacturing to selling products or services whether they are tangible or intangible.  Are Now being done with the help of computers, E.g. Product design using solidworks, IoT devices to Aid in manufacturing, Online selling through ecommerce platforms like Amazon, Digital Marketing with Google Adsense &amp; FacebookAds.  In simple words “Internet &amp; Computers” are missing or I would rahther say ignored by our so called “Indian Education System”.Grade system, to test student ablilities (Yikes),  Cause we never know how much a student knows about something without testing him/her in a real world scenario.  Discussions/Debate/Interviews/Internships are good way to test a students' abilities.Real world financial education  They teach us about how to manage company funds, not how to manage our own funds.  In simple words: how to maxmimize our income &amp; gains(investing), &amp; not how to minimize your expenses(savings)  Every student nowadays own a smartphone worth of atleast 20k &amp; they dont even use to its full potential  i.e. we can do content creation, digital marketing, programming, learn trading &amp; many other things all this for free. ,  but they do they do instead ? Gaming typically battle royale like PUBG or Free Fire.  Or Social Media a new drug in the market, We can see “busy students” outside every education institutes, Scrolling through their facebook, twitter, instagram etc.Result  Traditional teaching apporoach(Theortical) + Out of date syllabus + Irrelevant subjects = A piece of paper that is of no use &amp; a human with no particular skill in hand.Solutions(How???)  More real world subjects like digital marketing.  Book keeping using erp softwares like Busy.  Enterprise Resource Mangement using Odoo Erp or Dolibarr.  Official work using presentations, spreadsheets etc.  New Passion related subjects like  Music Production using Digital Audio Workstation, Also Writing Lyrics.  Video Production using DSLR Cameras &amp; Processing it using Adobe premeier. Also writing screenplay or jokes for standup comedians  Renewable energy using solar panels &amp; wind mills etc.  Game development using Unity.  Android app development using kotlin &amp; android sdk.  Architectural planning using AutoCAD &amp; Autodesk Revit.  Web security using OWASP study material &amp; Burpsuite.  (…Insert any topic with their real world applications)  Freedom for students to choose what they want to be in their life, regardless of their gender, grades, or whatever.  btw i didnt included any medical &amp; engineering topics as they are already too common in india.  Learn by doing is always the best apporoach to learn something!Conclusion(When???)  I think we should all focus on heading towards the solutions  But sadly we’re mostly still stuck in time,  All I see is youngsters here in my area are just preparing for laid back 9 to 1 govt jobs (&amp; yes most govt. clerks work from 9am to 1pm, or govt. teachers 8am to 2pm max)  This is happening often due to herd mentality (i.e. sheep follow sheep)  Anyways My belief is Everything is Learned a Skill.  Nobody is born with talent/Skill  but exceptions are always there ;)Thank you very much for reading till the end, Hope you have a great day. :)",
            "content_html": "<h2 id=\"problems-or-what--why\">Problems or (What &amp; Why?)??</h2><h3 id=\"why-people-are-chasing-success-what-do-they-mean-by-success-is-financial-success-is-everything\">Why people are chasing success? What do they mean by success? is financial success is everything?</h3><ul>  <li>As of now in 2021's India Most people think success is getting a govt. job &amp; that's it!But I dont think so? is govt job is keep up to everything want in life? No, its just a secure jobwhile nothing is permanent in this world, they think are settled, but in real life, nobody gets settledafter getting, we gotta repeat same things almost daily, and repetition is equal to boredom.</li>  <li>From my perespective i think life is about balacing all aspects of human a beings' life,I mean keeping everything balanced from work life to social life, childhood to parenthood, physical health to mental health everything needs to balanced, While our education system only teachs about how to get a job, not how to live a life.</li>  <li>Anyways here are some problems that i faced/found in our current indian education system while i was studying commerce from school &amp;  college.</li></ul><h3 id=\"irrelevant-subjects\">Irrelevant subjects</h3><ul>  <li>Like Business &amp; Industerial Laws, Hindi Language. This subject must be relevant to Law/Hindi specialization students only.</li>  <li>However these subjects can be recommended &amp; but not mandatory to study (Optionally any one can look it up on internet, if they want to).</li></ul><h3 id=\"out-of-date-syllabuscircicullum\">Out of date syllabus/circicullum</h3><ul>  <li>In modern day society accounting is mostly done through computers. But they dont teach us about computers</li>  <li>They dont teach us about Book Keeping softwares like Busy, Tally etc.</li>  <li>&amp; Even Nowadays from manufacturing to selling products or services whether they are tangible or intangible.</li>  <li>Are Now being done with the help of computers, E.g. Product design using solidworks, IoT devices to Aid in manufacturing, Online selling through ecommerce platforms like Amazon, Digital Marketing with Google Adsense &amp; FacebookAds.</li>  <li>In simple words “Internet &amp; Computers” are missing or I would rahther say ignored by our so called “Indian Education System”.</li></ul><h3 id=\"grade-system-to-test-student-ablilities-yikes\">Grade system, to test student ablilities (Yikes),</h3><ul>  <li>Cause we never know how much a student knows about something without testing him/her in a real world scenario.</li>  <li>Discussions/Debate/Interviews/Internships are good way to test a students' abilities.</li></ul><h2 id=\"real-world-financial-education\">Real world financial education</h2><ul>  <li>They teach us about how to manage company funds, not how to manage our own funds.</li>  <li>In simple words: how to maxmimize our income &amp; gains(investing), &amp; not how to minimize your expenses(savings)</li>  <li>Every student nowadays own a smartphone worth of atleast 20k &amp; they dont even use to its full potential</li>  <li>i.e. we can do content creation, digital marketing, programming, learn trading &amp; many other things all this for free. ,</li>  <li>but they do they do instead ? Gaming typically battle royale like PUBG or Free Fire.</li>  <li>Or Social Media a new drug in the market, We can see “busy students” outside every education institutes, Scrolling through their facebook, twitter, instagram etc.</li></ul><h2 id=\"result\">Result</h2><ul>  <li>Traditional teaching apporoach(Theortical) + Out of date syllabus + Irrelevant subjects = A piece of paper that is of no use &amp; a human with no particular skill in hand.</li></ul><h1 id=\"solutionshow\">Solutions(How???)</h1><ul>  <li>More real world subjects like digital marketing.</li>  <li>Book keeping using erp softwares like Busy.</li>  <li>Enterprise Resource Mangement using Odoo Erp or Dolibarr.</li>  <li>Official work using presentations, spreadsheets etc.</li>  <li>New Passion related subjects like</li>  <li>Music Production using Digital Audio Workstation, Also Writing Lyrics.</li>  <li>Video Production using DSLR Cameras &amp; Processing it using Adobe premeier. Also writing screenplay or jokes for standup comedians</li>  <li>Renewable energy using solar panels &amp; wind mills etc.</li>  <li>Game development using Unity.</li>  <li>Android app development using kotlin &amp; android sdk.</li>  <li>Architectural planning using AutoCAD &amp; Autodesk Revit.</li>  <li>Web security using OWASP study material &amp; Burpsuite.</li>  <li>(…Insert any topic with their real world applications)</li>  <li>Freedom for students to choose what they want to be in their life, regardless of their gender, grades, or whatever.</li>  <li>btw i didnt included any medical &amp; engineering topics as they are already too common in india.</li>  <li>Learn by doing is always the best apporoach to learn something!</li></ul><h2 id=\"conclusionwhen\">Conclusion(When???)</h2><ul>  <li>I think we should all focus on heading towards the solutions</li>  <li>But sadly we’re mostly still stuck in time,</li>  <li>All I see is youngsters here in my area are just preparing for laid back 9 to 1 govt jobs (&amp; yes most govt. clerks work from 9am to 1pm, or govt. teachers 8am to 2pm max)</li>  <li>This is happening often due to herd mentality (i.e. sheep follow sheep)</li>  <li>Anyways My belief is Everything is Learned a Skill.</li>  <li>Nobody is born with talent/Skill</li>  <li>but exceptions are always there ;)</li></ul><h2 id=\"thank-you-very-much-for-reading-till-the-end-hope-you-have-a-great-day-\">Thank you very much for reading till the end, Hope you have a great day. :)</h2>",
            "url": "https://t4p4n.github.io/2021/12/24/education-rant",
            
            
            
            "tags": ["education","rant"],
            
            "date_published": "2021-12-24T00:00:00+05:30",
            "date_modified": "2021-12-24T00:00:00+05:30",
            
                "author":  {
                "name": "Tapan Kashyap",
                "url": null,
                "avatar": null
                }
                
            
        },
    
        {
            "id": "https://t4p4n.github.io/2021/12/23/hello-world",
            "title": "Hello World",
            "summary": null,
            "content_text": "TitleMain HeadHello World this is working i guess!Sub Head  List Item          nested item                  more nests                    Code Snippet",
            "content_html": "<h1 id=\"title\">Title</h1><h2 id=\"main-head\">Main Head</h2><p>Hello World this is working i guess!</p><h2 id=\"sub-head\">Sub Head</h2><ul>  <li>List Item    <ul>      <li>nested item        <ul>          <li>more nests</li>        </ul>      </li>    </ul>  </li></ul><p><code class=\"language-plaintext highlighter-rouge\">Code Snippet</code></p>",
            "url": "https://t4p4n.github.io/2021/12/23/hello-world",
            
            
            
            
            
            "date_published": "2021-12-23T00:00:00+05:30",
            "date_modified": "2021-12-23T00:00:00+05:30",
            
                "author":  {
                "name": "Tapan Kashyap",
                "url": null,
                "avatar": null
                }
                
            
        }
    
    ]
}